Autodesk.Revit.DB.CurveIntersectResult.CreateByIntersectingForAPI(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.CurveIntersectResultOption)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.CurveIntersectResult.GetOverlaps
Gets information about the points shared between the two curves.
Remarks:
A CurveOverlapPoint whose type is CurveOverlapPointType.Intersection indicates an individual
point of transverse intersection. An interval of curve overlap is indicated by two consecutive
points -- the start point of the interval (having Type CurveOverlapPointType.IntervalStart), immediately
followed by the end point of the interval (having Type CurveOverlapPointType.IntervalEnd).
An overlap interval may be degenerate, in which case it indicates that the two curves are arranged
end-to-end with shared end points. The Overlaps of a CurveIntersectResult may contain a combination
of one or more intersection points and/or overlap intervals.
Returns:
The list of CurveOverLapPoints corresponding to points of intersection and/or intervals of overlap for the two curves.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This CurveIntersectResult only contains simple output. Use CurveIntersectResultOption::Detailed to compute detailed output.
Since:
2026

Autodesk.Revit.DB.CurveIntersectResult.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.CurveIntersectResult.Result
The classification of intersection or overlap between the two curves.
Remarks:
SetComparisonResult.Overlap - One or more intersections or overlapping intervals were encountered.
SetComparisonResult.Subset - The curve used to invoke the intersection check is a bound curve whose bounded interval is entirely within the curve passed as an argument.
SetComparisonResult.Superset - The bounded input curve is entirely within the curve used to invoke the intersection check.
SetComparisonResult.Disjoint - There is no intersection or overlap found between the two curves.
SetComparisonResult.Equal - The two curves are identical.
Since:
2026

Autodesk.Revit.DB.CurveIntersectResult
Contains the result of intersecting two curves and, if requested, a description of points where the two curves overlap or intersect.
Since:
2026